Revit 2024 API
Alignment.GetPointAtStation Method
 Calculates the model point for a given alignment station.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public XYZ GetPointAtStation(
	double station
)
Visual Basic
Public Function GetPointAtStation ( _
	station As Double _
) As XYZ
Visual C++
public:
XYZ^ GetPointAtStation(
	double station
)
Parameters
station
Type: System.Double
The alignment station for which to calculate the point, in Revit internal model units (standard Imperial feet).
Return Value
The model point at the given alignment station.
See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace